#Напишите код, который переводит целое число в строку, при том что его можно применить в любой системе счисления.
str_a = '10'
b = 40
c = int(str_a) + b
print ("Значение 'C' = ",c)